/*
url:省市数据josn文件路径
prov:默认省份
city:默认城市
dist:默认地区（县）
nodata:无数据状态
required:必选项
*/
(function($){
	$.fn.citySelect=function(settings){
		if(this.length<1){return;};

		// 默认值
		settings=$.extend({
			url:{
    "citylist": [
        {
            "p": "北京",
            "c": [
                {
                    "n": "北京"
                }
            ]
        },
        {
            "p": "天津",
            "c": [
                {
                    "n": "天津"
                }
            ]
        },
        {
            "p": "河北",
            "c": [
                {
                    "n": "石家庄",
                    "a": [
                        {
                            "s": "长安区"
                        },
                        {
                            "s": "桥东区"
                        },
                        {
                            "s": "桥西区"
                        },
                        {
                            "s": "新华区"
                        },
                        {
                            "s": "井陉矿区"
                        },
                        {
                            "s": "裕华区"
                        },
                        {
                            "s": "井陉县"
                        },
                        {
                            "s": "正定县"
                        },
                        {
                            "s": "栾城县"
                        },
                        {
                            "s": "行唐县"
                        },
                        {
                            "s": "灵寿县"
                        },
                        {
                            "s": "高邑县"
                        },
                        {
                            "s": "深泽县"
                        },
                        {
                            "s": "赞皇县"
                        },
                        {
                            "s": "无极县"
                        },
                        {
                            "s": "平山县"
                        },
                        {
                            "s": "元氏县"
                        },
                        {
                            "s": "赵县"
                        },
                        {
                            "s": "辛集市"
                        },
                        {
                            "s": "藁城市"
                        },
                        {
                            "s": "晋州市"
                        },
                        {
                            "s": "新乐市"
                        },
                        {
                            "s": "鹿泉市"
                        }
                    ]
                },
                {
                    "n": "唐山",
                    "a": [
                        {
                            "s": "路南区"
                        },
                        {
                            "s": "路北区"
                        },
                        {
                            "s": "古冶区"
                        },
                        {
                            "s": "开平区"
                        },
                        {
                            "s": "丰南区"
                        },
                        {
                            "s": "丰润区"
                        },
                        {
                            "s": "滦县"
                        },
                        {
                            "s": "滦南县"
                        },
                        {
                            "s": "乐亭县"
                        },
                        {
                            "s": "迁西县"
                        },
                        {
                            "s": "玉田县"
                        },
                        {
                            "s": "唐海县"
                        },
                        {
                            "s": "遵化市"
                        },
                        {
                            "s": "迁安市"
                        }
                    ]
                },
                {
                    "n": "秦皇岛",
                    "a": [
                        {
                            "s": "海港区"
                        },
                        {
                            "s": "山海关区"
                        },
                        {
                            "s": "北戴河区"
                        },
                        {
                            "s": "青龙满族自治县"
                        },
                        {
                            "s": "昌黎县"
                        },
                        {
                            "s": "抚宁县"
                        },
                        {
                            "s": "卢龙县"
                        }
                    ]
                },
                {
                    "n": "邯郸",
                    "a": [
                        {
                            "s": "邯山区"
                        },
                        {
                            "s": "丛台区"
                        },
                        {
                            "s": "复兴区"
                        },
                        {
                            "s": "峰峰矿区"
                        },
                        {
                            "s": "邯郸县"
                        },
                        {
                            "s": "临漳县"
                        },
                        {
                            "s": "成安县"
                        },
                        {
                            "s": "大名县"
                        },
                        {
                            "s": "涉县"
                        },
                        {
                            "s": "磁县"
                        },
                        {
                            "s": "肥乡县"
                        },
                        {
                            "s": "永年县"
                        },
                        {
                            "s": "邱县"
                        },
                        {
                            "s": "鸡泽县"
                        },
                        {
                            "s": "广平县"
                        },
                        {
                            "s": "馆陶县"
                        },
                        {
                            "s": "魏县"
                        },
                        {
                            "s": "曲周县"
                        },
                        {
                            "s": "武安市"
                        }
                    ]
                },
                {
                    "n": "邢台",
                    "a": [
                        {
                            "s": "桥东区"
                        },
                        {
                            "s": "桥西区"
                        },
                        {
                            "s": "邢台县"
                        },
                        {
                            "s": "临城县"
                        },
                        {
                            "s": "内丘县"
                        },
                        {
                            "s": "柏乡县"
                        },
                        {
                            "s": "隆尧县"
                        },
                        {
                            "s": "任县"
                        },
                        {
                            "s": "南和县"
                        },
                        {
                            "s": "宁晋县"
                        },
                        {
                            "s": "巨鹿县"
                        },
                        {
                            "s": "新河县"
                        },
                        {
                            "s": "广宗县"
                        },
                        {
                            "s": "平乡县"
                        },
                        {
                            "s": "威县"
                        },
                        {
                            "s": "清河县"
                        },
                        {
                            "s": "临西县"
                        },
                        {
                            "s": "南宫市"
                        },
                        {
                            "s": "沙河市"
                        }
                    ]
                },
                {
                    "n": "保定",
                    "a": [
                        {
                            "s": "新市区"
                        },
                        {
                            "s": "北市区"
                        },
                        {
                            "s": "南市区"
                        },
                        {
                            "s": "满城县"
                        },
                        {
                            "s": "清苑县"
                        },
                        {
                            "s": "涞水县"
                        },
                        {
                            "s": "阜平县"
                        },
                        {
                            "s": "徐水县"
                        },
                        {
                            "s": "定兴县"
                        },
                        {
                            "s": "唐县"
                        },
                        {
                            "s": "高阳县"
                        },
                        {
                            "s": "容城县"
                        },
                        {
                            "s": "涞源县"
                        },
                        {
                            "s": "望都县"
                        },
                        {
                            "s": "安新县"
                        },
                        {
                            "s": "易县"
                        },
                        {
                            "s": "曲阳县"
                        },
                        {
                            "s": "蠡县"
                        },
                        {
                            "s": "顺平县"
                        },
                        {
                            "s": "博野县"
                        },
                        {
                            "s": "雄县"
                        },
                        {
                            "s": "涿州市"
                        },
                        {
                            "s": "定州市"
                        },
                        {
                            "s": "安国市"
                        },
                        {
                            "s": "高碑店市"
                        }
                    ]
                },
                {
                    "n": "张家口",
                    "a": [
                        {
                            "s": "桥东区"
                        },
                        {
                            "s": "桥西区"
                        },
                        {
                            "s": "宣化区"
                        },
                        {
                            "s": "下花园区"
                        },
                        {
                            "s": "宣化县"
                        },
                        {
                            "s": "张北县"
                        },
                        {
                            "s": "康保县"
                        },
                        {
                            "s": "沽源县"
                        },
                        {
                            "s": "尚义县"
                        },
                        {
                            "s": "蔚县"
                        },
                        {
                            "s": "阳原县"
                        },
                        {
                            "s": "怀安县"
                        },
                        {
                            "s": "万全县"
                        },
                        {
                            "s": "怀来县"
                        },
                        {
                            "s": "涿鹿县"
                        },
                        {
                            "s": "赤城县"
                        },
                        {
                            "s": "崇礼县"
                        }
                    ]
                },
                {
                    "n": "承德",
                    "a": [
                        {
                            "s": "双桥区"
                        },
                        {
                            "s": "双滦区"
                        },
                        {
                            "s": "鹰手营子矿区"
                        },
                        {
                            "s": "承德县"
                        },
                        {
                            "s": "兴隆县"
                        },
                        {
                            "s": "平泉县"
                        },
                        {
                            "s": "滦平县"
                        },
                        {
                            "s": "隆化县"
                        },
                        {
                            "s": "丰宁满族自治县"
                        },
                        {
                            "s": "宽城满族自治县"
                        },
                        {
                            "s": "围场满族蒙古族自治县"
                        }
                    ]
                },
                {
                    "n": "沧州",
                    "a": [
                        {
                            "s": "新华区"
                        },
                        {
                            "s": "运河区"
                        },
                        {
                            "s": "沧县"
                        },
                        {
                            "s": "青县"
                        },
                        {
                            "s": "东光县"
                        },
                        {
                            "s": "海兴县"
                        },
                        {
                            "s": "盐山县"
                        },
                        {
                            "s": "肃宁县"
                        },
                        {
                            "s": "南皮县"
                        },
                        {
                            "s": "吴桥县"
                        },
                        {
                            "s": "献县"
                        },
                        {
                            "s": "孟村回族自治县"
                        },
                        {
                            "s": "泊头市"
                        },
                        {
                            "s": "任丘市"
                        },
                        {
                            "s": "黄骅市"
                        },
                        {
                            "s": "河间市"
                        }
                    ]
                },
                {
                    "n": "廊坊",
                    "a": [
                        {
                            "s": "安次区"
                        },
                        {
                            "s": "广阳区"
                        },
                        {
                            "s": "固安县"
                        },
                        {
                            "s": "永清县"
                        },
                        {
                            "s": "香河县"
                        },
                        {
                            "s": "大城县"
                        },
                        {
                            "s": "文安县"
                        },
                        {
                            "s": "大厂回族自治县"
                        },
                        {
                            "s": "霸州市"
                        },
                        {
                            "s": "三河市"
                        }
                    ]
                },
                {
                    "n": "衡水",
                    "a": [
                        {
                            "s": "桃城区"
                        },
                        {
                            "s": "枣强县"
                        },
                        {
                            "s": "武邑县"
                        },
                        {
                            "s": "武强县"
                        },
                        {
                            "s": "饶阳县"
                        },
                        {
                            "s": "安平县"
                        },
                        {
                            "s": "故城县"
                        },
                        {
                            "s": "景县"
                        },
                        {
                            "s": "阜城县"
                        },
                        {
                            "s": "冀州市"
                        },
                        {
                            "s": "深州市"
                        }
                    ]
                }            ]
        },
        {
            "p": "山西",
            "c": [
                {
                    "n": "大同"
                },
               
                {
                    "n": "运城"
                }
            ]
        },
        {
            "p": "内蒙古",
            "c": [
             
                {
                    "n": "鄂尔多斯"
                }
            ]
        },
        {
            "p": "辽宁",
            "c": [
                {
                    "n": "沈阳"
                },
              
                {
                    "n": "阜新"
                },
                {
                    "n": "辽阳"
                },
               
                {
                    "n": "铁岭"
                },
               
                {
                    "n": "葫芦岛"
                },
                {
                    "n": "开原市"
                },
                {
                    "n": "凌海"
                },
                {
                    "n": "喀左"
                }
            ]
        },
        {
            "p": "吉林",
            "c": [
                {
                    "n": "长春"
                },
                {
                    "n": "吉林"
                },
               
                {
                    "n": "通化"
                },
                {
                    "n": "白山"
                },
                
                {
                    "n": "白城"
                },
                {
                    "n": "长白"
                },
                {
                    "n":"德惠"
                },
                {
                    "n":"白城"
                }
            ]
        },
        {
            "p": "黑龙江",
            "c": [
               
                {
                    "n": "齐齐哈尔",
                    "a": [
                        {
                            "s": "龙沙区"
                        },
                        {
                            "s": "建华区"
                        },
                        {
                            "s": "铁锋区"
                        },
                        {
                            "s": "昂昂溪区"
                        },
                        {
                            "s": "富拉尔基区"
                        },
                        {
                            "s": "碾子山区"
                        },
                        {
                            "s": "梅里斯达斡尔族区"
                        },
                        {
                            "s": "龙江县"
                        },
                        {
                            "s": "依安县"
                        },
                        {
                            "s": "泰来县"
                        },
                        {
                            "s": "甘南县"
                        },
                        {
                            "s": "富裕县"
                        },
                        {
                            "s": "克山县"
                        },
                        {
                            "s": "克东县"
                        },
                        {
                            "s": "拜泉县"
                        },
                        {
                            "s": "讷河市"
                        }
                    ]
                },
              
                {
                    "n": "绥化",
                    "a": [
                        {
                            "s": "北林区"
                        },
                        {
                            "s": "望奎县"
                        },
                        {
                            "s": "兰西县"
                        },
                        {
                            "s": "青冈县"
                        },
                        {
                            "s": "庆安县"
                        },
                        {
                            "s": "明水县"
                        },
                        {
                            "s": "绥棱县"
                        },
                        {
                            "s": "安达市"
                        },
                        {
                            "s": "肇东市"
                        },
                        {
                            "s": "海伦市"
                        }
                    ]
                },
                {
                    "n":"依安县"
                },
                {
                    "n":"讷河市"
                },
                {
                    "n":"海伦市"
                },
                {
                    "n":"绥棱市"
                },
                {
                    "n":"青冈县"
                },
                {
                    "n":"望奎县"
                },
                {
                    "n":"木兰县"
                },
                {
                    "n":"五常市"
                }
            ]
        },
        {
            "p": "上海",
            "c": [
                
                {
                    "n": "徐汇区"
                },
                {
                    "n": "普陀区"
                }
            ]
        },
        {
            "p": "江苏",
            "c": [
                {
                    "n": "南京",
                    "a": [
                        {
                            "s": "玄武区"
                        },
                        {
                            "s": "白下区"
                        },
                        {
                            "s": "秦淮区"
                        },
                        {
                            "s": "建邺区"
                        },
                        {
                            "s": "鼓楼区"
                        },
                        {
                            "s": "下关区"
                        },
                        {
                            "s": "浦口区"
                        },
                        {
                            "s": "栖霞区"
                        },
                        {
                            "s": "雨花台区"
                        },
                        {
                            "s": "江宁区"
                        },
                        {
                            "s": "六合区"
                        },
                        {
                            "s": "溧水县"
                        },
                        {
                            "s": "高淳县"
                        }
                    ]
                },
                {
                    "n": "无锡",
                    "a": [
                        {
                            "s": "崇安区"
                        },
                        {
                            "s": "南长区"
                        },
                        {
                            "s": "北塘区"
                        },
                        {
                            "s": "锡山区"
                        },
                        {
                            "s": "惠山区"
                        },
                        {
                            "s": "滨湖区"
                        },
                        {
                            "s": "江阴市"
                        },
                        {
                            "s": "宜兴市"
                        }
                    ]
                },
                {
                    "n": "徐州",
                    "a": [
                        {
                            "s": "鼓楼区"
                        },
                        {
                            "s": "云龙区"
                        },
                        {
                            "s": "九里区"
                        },
                        {
                            "s": "贾汪区"
                        },
                        {
                            "s": "泉山区"
                        },
                        {
                            "s": "丰县"
                        },
                        {
                            "s": "沛县"
                        },
                        {
                            "s": "铜山县"
                        },
                        {
                            "s": "睢宁县"
                        },
                        {
                            "s": "新沂市"
                        },
                        {
                            "s": "邳州市"
                        }
                    ]
                },
                {
                    "n": "常州",
                    "a": [
                        {
                            "s": "天宁区"
                        },
                        {
                            "s": "钟楼区"
                        },
                        {
                            "s": "戚墅堰区"
                        },
                        {
                            "s": "新北区"
                        },
                        {
                            "s": "武进区"
                        },
                        {
                            "s": "溧阳市"
                        },
                        {
                            "s": "金坛市"
                        }
                    ]
                },
                {
                    "n": "苏州",
                    "a": [
                        {
                            "s": "沧浪区"
                        },
                        {
                            "s": "平江区"
                        },
                        {
                            "s": "金阊区"
                        },
                        {
                            "s": "虎丘区"
                        },
                        {
                            "s": "吴中区"
                        },
                        {
                            "s": "相城区"
                        },
                        {
                            "s": "常熟市"
                        },
                        {
                            "s": "张家港市"
                        },
                        {
                            "s": "昆山市"
                        },
                        {
                            "s": "吴江市"
                        },
                        {
                            "s": "太仓市"
                        }
                    ]
                },
                {
                    "n": "南通",
                    "a": [
                        {
                            "s": "崇川区"
                        },
                        {
                            "s": "港闸区"
                        },
                        {
                            "s": "海安县"
                        },
                        {
                            "s": "如东县"
                        },
                        {
                            "s": "启东市"
                        },
                        {
                            "s": "如皋市"
                        },
                        {
                            "s": "通州市"
                        },
                        {
                            "s": "海门市"
                        }
                    ]
                },
                {
                    "n": "连云港",
                    "a": [
                        {
                            "s": "连云区"
                        },
                        {
                            "s": "新浦区"
                        },
                        {
                            "s": "海州区"
                        },
                        {
                            "s": "赣榆县"
                        },
                        {
                            "s": "东海县"
                        },
                        {
                            "s": "灌云县"
                        },
                        {
                            "s": "灌南县"
                        }
                    ]
                },
                {
                    "n": "淮安",
                    "a": [
                        {
                            "s": "清河区"
                        },
                        {
                            "s": "楚州区"
                        },
                        {
                            "s": "淮阴区"
                        },
                        {
                            "s": "清浦区"
                        },
                        {
                            "s": "涟水县"
                        },
                        {
                            "s": "洪泽县"
                        },
                        {
                            "s": "盱眙县"
                        },
                        {
                            "s": "金湖县"
                        }
                    ]
                },
                {
                    "n": "盐城",
                    "a": [
                        {
                            "s": "亭湖区"
                        },
                        {
                            "s": "盐都区"
                        },
                        {
                            "s": "响水县"
                        },
                        {
                            "s": "滨海县"
                        },
                        {
                            "s": "阜宁县"
                        },
                        {
                            "s": "射阳县"
                        },
                        {
                            "s": "建湖县"
                        },
                        {
                            "s": "东台市"
                        },
                        {
                            "s": "大丰市"
                        }
                    ]
                },
                {
                    "n": "扬州",
                    "a": [
                        {
                            "s": "广陵区"
                        },
                        {
                            "s": "邗江区"
                        },
                        {
                            "s": "维扬区"
                        },
                        {
                            "s": "宝应县"
                        },
                        {
                            "s": "仪征市"
                        },
                        {
                            "s": "高邮市"
                        },
                        {
                            "s": "江都市"
                        }
                    ]
                },
                {
                    "n": "镇江",
                    "a": [
                        {
                            "s": "京口区"
                        },
                        {
                            "s": "润州区"
                        },
                        {
                            "s": "丹徒区"
                        },
                        {
                            "s": "丹阳市"
                        },
                        {
                            "s": "扬中市"
                        },
                        {
                            "s": "句容市"
                        }
                    ]
                },
                {
                    "n": "泰州",
                    "a": [
                        {
                            "s": "海陵区"
                        },
                        {
                            "s": "高港区"
                        },
                        {
                            "s": "兴化市"
                        },
                        {
                            "s": "靖江市"
                        },
                        {
                            "s": "泰兴市"
                        },
                        {
                            "s": "姜堰市"
                        }
                    ]
                },
                {
                    "n": "宿迁",
                    "a": [
                        {
                            "s": "宿城区"
                        },
                        {
                            "s": "宿豫区"
                        },
                        {
                            "s": "沭阳县"
                        },
                        {
                            "s": "泗阳县"
                        },
                        {
                            "s": "泗洪县"
                        }
                    ]
                }
            ]
        },
        {
            "p": "浙江",
            "c": [

                {
                    "n": "湖州",
                    "a": [
                        {
                            "s": "吴兴区"
                        },
                        {
                            "s": "南浔区"
                        },
                        {
                            "s": "德清县"
                        },
                        {
                            "s": "长兴县"
                        },
                        {
                            "s": "安吉县"
                        }
                    ]
                }
            ]
        },
        {
            "p": "安徽",
            "c": [
               
                {
                    "n": "淮南",
                    "a": [
                        {
                            "s": "大通区"
                        },
                        {
                            "s": "田家庵区"
                        },
                        {
                            "s": "谢家集区"
                        },
                        {
                            "s": "八公山区"
                        },
                        {
                            "s": "潘集区"
                        },
                        {
                            "s": "凤台县"
                        }
                    ]
                }
            ]
        },
        {
            "p": "福建",
            "c": [
                {
                    "n": "福州",
                    "a": [
                        {
                            "s": "鼓楼区"
                        },
                        {
                            "s": "台江区"
                        },
                        {
                            "s": "仓山区"
                        },
                        {
                            "s": "马尾区"
                        },
                        {
                            "s": "晋安区"
                        },
                        {
                            "s": "闽侯县"
                        },
                        {
                            "s": "连江县"
                        },
                        {
                            "s": "罗源县"
                        },
                        {
                            "s": "闽清县"
                        },
                        {
                            "s": "永泰县"
                        },
                        {
                            "s": "平潭县"
                        },
                        {
                            "s": "福清市"
                        },
                        {
                            "s": "长乐市"
                        }
                    ]
                },
                {
                    "n": "厦门",
                    "a": [
                        {
                            "s": "思明区"
                        },
                        {
                            "s": "海沧区"
                        },
                        {
                            "s": "湖里区"
                        },
                        {
                            "s": "集美区"
                        },
                        {
                            "s": "同安区"
                        },
                        {
                            "s": "翔安区"
                        }
                    ]
                },
                {
                    "n": "莆田",
                    "a": [
                        {
                            "s": "城厢区"
                        },
                        {
                            "s": "涵江区"
                        },
                        {
                            "s": "荔城区"
                        },
                        {
                            "s": "秀屿区"
                        },
                        {
                            "s": "仙游县"
                        }
                    ]
                },
               
                {
                    "n": "泉州",
                    "a": [
                        {
                            "s": "鲤城区"
                        },
                        {
                            "s": "丰泽区"
                        },
                        {
                            "s": "洛江区"
                        },
                        {
                            "s": "泉港区"
                        },
                        {
                            "s": "惠安县"
                        },
                        {
                            "s": "安溪县"
                        },
                        {
                            "s": "永春县"
                        },
                        {
                            "s": "德化县"
                        },
                        {
                            "s": "金门县"
                        },
                        {
                            "s": "石狮市"
                        },
                        {
                            "s": "晋江市"
                        },
                        {
                            "s": "南安市"
                        }
                    ]
                },
                {
                    "n": "漳州",
                    "a": [
                        {
                            "s": "芗城区"
                        },
                        {
                            "s": "龙文区"
                        },
                        {
                            "s": "云霄县"
                        },
                        {
                            "s": "漳浦县"
                        },
                        {
                            "s": "诏安县"
                        },
                        {
                            "s": "长泰县"
                        },
                        {
                            "s": "东山县"
                        },
                        {
                            "s": "南靖县"
                        },
                        {
                            "s": "平和县"
                        },
                        {
                            "s": "华安县"
                        },
                        {
                            "s": "龙海市"
                        }
                    ]
                },
                {
                    "n": "南平",
                    "a": [
                        {
                            "s": "延平区"
                        },
                        {
                            "s": "顺昌县"
                        },
                        {
                            "s": "浦城县"
                        },
                        {
                            "s": "光泽县"
                        },
                        {
                            "s": "松溪县"
                        },
                        {
                            "s": "政和县"
                        },
                        {
                            "s": "邵武市"
                        },
                        {
                            "s": "武夷山市"
                        },
                        {
                            "s": "建瓯市"
                        },
                        {
                            "s": "建阳市"
                        }
                    ]
                },
                {
                    "n": "龙岩",
                    "a": [
                        {
                            "s": "新罗区"
                        },
                        {
                            "s": "长汀县"
                        },
                        {
                            "s": "永定县"
                        },
                        {
                            "s": "上杭县"
                        },
                        {
                            "s": "武平县"
                        },
                        {
                            "s": "连城县"
                        },
                        {
                            "s": "漳平市"
                        }
                    ]
                },
                {
                    "n": "宁德",
                    "a": [
                        {
                            "s": "蕉城区"
                        },
                        {
                            "s": "霞浦县"
                        },
                        {
                            "s": "古田县"
                        },
                        {
                            "s": "屏南县"
                        },
                        {
                            "s": "寿宁县"
                        },
                        {
                            "s": "周宁县"
                        },
                        {
                            "s": "柘荣县"
                        },
                        {
                            "s": "福安市"
                        },
                        {
                            "s": "福鼎市"
                        }
                    ]
                }
            ]
        },
        {
            "p": "江西",
            "c": [
               
               
                {
                    "n": "九江",
                    "a": [
                        {
                            "s": "庐山区"
                        },
                        {
                            "s": "浔阳区"
                        },
                        {
                            "s": "九江县"
                        },
                        {
                            "s": "武宁县"
                        },
                        {
                            "s": "修水县"
                        },
                        {
                            "s": "永修县"
                        },
                        {
                            "s": "德安县"
                        },
                        {
                            "s": "星子县"
                        },
                        {
                            "s": "都昌县"
                        },
                        {
                            "s": "湖口县"
                        },
                        {
                            "s": "彭泽县"
                        },
                        {
                            "s": "瑞昌市"
                        }
                    ]
                },
              
                {
                    "n": "上饶",
                    "a": [
                        {
                            "s": "信州区"
                        },
                        {
                            "s": "上饶县"
                        },
                        {
                            "s": "广丰县"
                        },
                        {
                            "s": "玉山县"
                        },
                        {
                            "s": "铅山县"
                        },
                        {
                            "s": "横峰县"
                        },
                        {
                            "s": "弋阳县"
                        },
                        {
                            "s": "余干县"
                        },
                        {
                            "s": "鄱阳县"
                        },
                        {
                            "s": "万年县"
                        },
                        {
                            "s": "婺源县"
                        },
                        {
                            "s": "德兴市"
                        }
                    ]
                }
            ]
        },
        {
            "p": "山东",
            "c": [
                
                {
                    "n": "青岛",
                    "a": [
                        {
                            "s": "市南区"
                        },
                        {
                            "s": "市北区"
                        },
                        {
                            "s": "四方区"
                        },
                        {
                            "s": "黄岛区"
                        },
                        {
                            "s": "崂山区"
                        },
                        {
                            "s": "李沧区"
                        },
                        {
                            "s": "城阳区"
                        },
                        {
                            "s": "胶州市"
                        },
                        {
                            "s": "即墨市"
                        },
                        {
                            "s": "平度市"
                        },
                        {
                            "s": "胶南市"
                        },
                        {
                            "s": "莱西市"
                        }
                    ]
                },
              
                {
                    "n": "潍坊",
                    "a": [
                        {
                            "s": "潍城区"
                        },
                        {
                            "s": "寒亭区"
                        },
                        {
                            "s": "坊子区"
                        },
                        {
                            "s": "奎文区"
                        },
                        {
                            "s": "临朐县"
                        },
                        {
                            "s": "昌乐县"
                        },
                        {
                            "s": "青州市"
                        },
                        {
                            "s": "诸城市"
                        },
                        {
                            "s": "寿光市"
                        },
                        {
                            "s": "安丘市"
                        },
                        {
                            "s": "高密市"
                        },
                        {
                            "s": "昌邑市"
                        }
                    ]
                },
                {
                    "n": "济宁",
                    "a": [
                        {
                            "s": "市中区"
                        },
                        {
                            "s": "任城区"
                        },
                        {
                            "s": "微山县"
                        },
                        {
                            "s": "鱼台县"
                        },
                        {
                            "s": "金乡县"
                        },
                        {
                            "s": "嘉祥县"
                        },
                        {
                            "s": "汶上县"
                        },
                        {
                            "s": "泗水县"
                        },
                        {
                            "s": "梁山县"
                        },
                        {
                            "s": "曲阜市"
                        },
                        {
                            "s": "兖州市"
                        },
                        {
                            "s": "邹城市"
                        }
                    ]
                }
            ]
        },
        {
            "p": "河南",
            "c": [
               
                {
                    "n": "洛阳",
                    "a": [
                        {
                            "s": "老城区"
                        },
                        {
                            "s": "西工区"
                        },
                        {
                            "s": "廛河回族区"
                        },
                        {
                            "s": "涧西区"
                        },
                        {
                            "s": "吉利区"
                        },
                        {
                            "s": "洛龙区"
                        },
                        {
                            "s": "孟津县"
                        },
                        {
                            "s": "新安县"
                        },
                        {
                            "s": "栾川县"
                        },
                        {
                            "s": "嵩县"
                        },
                        {
                            "s": "汝阳县"
                        },
                        {
                            "s": "宜阳县"
                        },
                        {
                            "s": "洛宁县"
                        },
                        {
                            "s": "伊川县"
                        },
                        {
                            "s": "偃师市"
                        }
                    ]
                },
                
                {
                    "n": "安阳",
                    "a": [
                        {
                            "s": "文峰区"
                        },
                        {
                            "s": "北关区"
                        },
                        {
                            "s": "殷都区"
                        },
                        {
                            "s": "龙安区"
                        },
                        {
                            "s": "安阳县"
                        },
                        {
                            "s": "汤阴县"
                        },
                        {
                            "s": "滑县"
                        },
                        {
                            "s": "内黄县"
                        },
                        {
                            "s": "林州市"
                        }
                    ]
                },
              
                {
                    "n": "新乡",
                    "a": [
                        {
                            "s": "红旗区"
                        },
                        {
                            "s": "卫滨区"
                        },
                        {
                            "s": "凤泉区"
                        },
                        {
                            "s": "牧野区"
                        },
                        {
                            "s": "新乡县"
                        },
                        {
                            "s": "获嘉县"
                        },
                        {
                            "s": "原阳县"
                        },
                        {
                            "s": "延津县"
                        },
                        {
                            "s": "封丘县"
                        },
                        {
                            "s": "长垣县"
                        },
                        {
                            "s": "卫辉市"
                        },
                        {
                            "s": "辉县市"
                        }
                    ]
                },
                {
                    "n": "焦作",
                    "a": [
                        {
                            "s": "解放区"
                        },
                        {
                            "s": "中站区"
                        },
                        {
                            "s": "马村区"
                        },
                        {
                            "s": "山阳区"
                        },
                        {
                            "s": "修武县"
                        },
                        {
                            "s": "博爱县"
                        },
                        {
                            "s": "武陟县"
                        },
                        {
                            "s": "温县"
                        },
                        {
                            "s": "沁阳市"
                        },
                        {
                            "s": "孟州市"
                        }
                    ]
                },
                
                {
                    "n": "许昌",
                    "a": [
                        {
                            "s": "魏都区"
                        },
                        {
                            "s": "许昌县"
                        },
                        {
                            "s": "鄢陵县"
                        },
                        {
                            "s": "襄城县"
                        },
                        {
                            "s": "禹州市"
                        },
                        {
                            "s": "长葛市"
                        }
                    ]
                },
                {
                    "n": "漯河",
                    "a": [
                        {
                            "s": "源汇区"
                        },
                        {
                            "s": "郾城区"
                        },
                        {
                            "s": "召陵区"
                        },
                        {
                            "s": "舞阳县"
                        },
                        {
                            "s": "临颍县"
                        }
                    ]
                },
             
                {
                    "n": "周口",
                    "a": [
                        {
                            "s": "川汇区"
                        },
                        {
                            "s": "扶沟县"
                        },
                        {
                            "s": "西华县"
                        },
                        {
                            "s": "商水县"
                        },
                        {
                            "s": "沈丘县"
                        },
                        {
                            "s": "郸城县"
                        },
                        {
                            "s": "淮阳县"
                        },
                        {
                            "s": "太康县"
                        },
                        {
                            "s": "鹿邑县"
                        },
                        {
                            "s": "项城市"
                        }
                    ]
                },
                {
                    "n":"辉县市"
                },
                {
                    "n":"延津"
                }
            ]
        },
        {
            "p": "湖北",
            "c": [
              
                {
                    "n": "十堰",
                    "a": [
                        {
                            "s": "茅箭区"
                        },
                        {
                            "s": "张湾区"
                        },
                        {
                            "s": "郧县"
                        },
                        {
                            "s": "郧西县"
                        },
                        {
                            "s": "竹山县"
                        },
                        {
                            "s": "竹溪县"
                        },
                        {
                            "s": "房县"
                        },
                        {
                            "s": "丹江口市"
                        }
                    ]
                },
              
                {
                    "n": "鄂州",
                    "a": [
                        {
                            "s": "梁子湖区"
                        },
                        {
                            "s": "华容区"
                        },
                        {
                            "s": "鄂城区"
                        }
                    ]
                },
                {
                    "n": "荆门",
                    "a": [
                        {
                            "s": "东宝区"
                        },
                        {
                            "s": "掇刀区"
                        },
                        {
                            "s": "京山县"
                        },
                        {
                            "s": "沙洋县"
                        },
                        {
                            "s": "钟祥市"
                        }
                    ]
                },
                {
                    "n": "孝感",
                    "a": [
                        {
                            "s": "孝南区"
                        },
                        {
                            "s": "孝昌县"
                        },
                        {
                            "s": "大悟县"
                        },
                        {
                            "s": "云梦县"
                        },
                        {
                            "s": "应城市"
                        },
                        {
                            "s": "安陆市"
                        },
                        {
                            "s": "汉川市"
                        }
                    ]
                },
                {
                    "n": "荆州",
                    "a": [
                        {
                            "s": "沙市区"
                        },
                        {
                            "s": "荆州区"
                        },
                        {
                            "s": "公安县"
                        },
                        {
                            "s": "监利县"
                        },
                        {
                            "s": "江陵县"
                        },
                        {
                            "s": "石首市"
                        },
                        {
                            "s": "洪湖市"
                        },
                        {
                            "s": "松滋市"
                        }
                    ]
                },
                {
                    "n": "黄冈",
                    "a": [
                        {
                            "s": "黄州区"
                        },
                        {
                            "s": "团风县"
                        },
                        {
                            "s": "红安县"
                        },
                        {
                            "s": "罗田县"
                        },
                        {
                            "s": "英山县"
                        },
                        {
                            "s": "浠水县"
                        },
                        {
                            "s": "蕲春县"
                        },
                        {
                            "s": "黄梅县"
                        },
                        {
                            "s": "麻城市"
                        },
                        {
                            "s": "武穴市"
                        }
                    ]
                },
                {
                    "n": "咸宁",
                    "a": [
                        {
                            "s": "咸安区"
                        },
                        {
                            "s": "嘉鱼县"
                        },
                        {
                            "s": "通城县"
                        },
                        {
                            "s": "崇阳县"
                        },
                        {
                            "s": "通山县"
                        },
                        {
                            "s": "赤壁市"
                        }
                    ]
                },
               
                {
                    "n": "仙桃",
                    "a": [
                        {
                            "s": "仙桃"
                        }
                    ]
                },
               
                {
                    "n": "天门",
                    "a": [
                        {
                            "s": "天门"
                        }
                    ]
                },
                {
                    "n": "神农架",
                    "a": [
                        {
                            "s": "神农架"
                        }
                    ]
                },
                {
                    "n":"襄阳"
                },
                {
                    "n":"京山县"
                },
                {
                    "n":"武穴"
                },
                {
                    "n":"宜都"
                },
                {
                    "n":"江陵"
                }
            ]
        },
        {
            "p": "湖南",
            "c": [
                {
                    "n": "长沙",
                    "a": [
                        {
                            "s": "芙蓉区"
                        },
                        {
                            "s": "天心区"
                        },
                        {
                            "s": "岳麓区"
                        },
                        {
                            "s": "开福区"
                        },
                        {
                            "s": "雨花区"
                        },
                        {
                            "s": "长沙县"
                        },
                        {
                            "s": "望城县"
                        },
                        {
                            "s": "宁乡县"
                        },
                        {
                            "s": "浏阳市"
                        }
                    ]
                },
                {
                    "n": "株洲",
                    "a": [
                        {
                            "s": "荷塘区"
                        },
                        {
                            "s": "芦淞区"
                        },
                        {
                            "s": "石峰区"
                        },
                        {
                            "s": "天元区"
                        },
                        {
                            "s": "株洲县"
                        },
                        {
                            "s": "攸县"
                        },
                        {
                            "s": "茶陵县"
                        },
                        {
                            "s": "炎陵县"
                        },
                        {
                            "s": "醴陵市"
                        }
                    ]
                },
                {
                    "n": "湘潭",
                    "a": [
                        {
                            "s": "雨湖区"
                        },
                        {
                            "s": "岳塘区"
                        },
                        {
                            "s": "湘潭县"
                        },
                        {
                            "s": "湘乡市"
                        },
                        {
                            "s": "韶山市"
                        }
                    ]
                },
                {
                    "n": "衡阳",
                    "a": [
                        {
                            "s": "珠晖区"
                        },
                        {
                            "s": "雁峰区"
                        },
                        {
                            "s": "石鼓区"
                        },
                        {
                            "s": "蒸湘区"
                        },
                        {
                            "s": "南岳区"
                        },
                        {
                            "s": "衡阳县"
                        },
                        {
                            "s": "衡南县"
                        },
                        {
                            "s": "衡山县"
                        },
                        {
                            "s": "衡东县"
                        },
                        {
                            "s": "祁东县"
                        },
                        {
                            "s": "耒阳市"
                        },
                        {
                            "s": "常宁市"
                        }
                    ]
                },
                
                {
                    "n": "岳阳",
                    "a": [
                        {
                            "s": "岳阳楼区"
                        },
                        {
                            "s": "云溪区"
                        },
                        {
                            "s": "君山区"
                        },
                        {
                            "s": "岳阳县"
                        },
                        {
                            "s": "华容县"
                        },
                        {
                            "s": "湘阴县"
                        },
                        {
                            "s": "平江县"
                        },
                        {
                            "s": "汨罗市"
                        },
                        {
                            "s": "临湘市"
                        }
                    ]
                },
                
                {
                    "n": "益阳",
                    "a": [
                        {
                            "s": "资阳区"
                        },
                        {
                            "s": "赫山区"
                        },
                        {
                            "s": "南县"
                        },
                        {
                            "s": "桃江县"
                        },
                        {
                            "s": "安化县"
                        },
                        {
                            "s": "沅江市"
                        }
                    ]
                },
                {
                    "n":"安化县"
                }
               
            ]
        },
        {
            "p": "广东",
            "c": [
                {
                    "n": "广州",
                    "a": [
                        {
                            "s": "荔湾区"
                        },
                        {
                            "s": "越秀区"
                        },
                        {
                            "s": "海珠区"
                        },
                        {
                            "s": "天河区"
                        },
                        {
                            "s": "白云区"
                        },
                        {
                            "s": "黄埔区"
                        },
                        {
                            "s": "番禺区"
                        },
                        {
                            "s": "花都区"
                        },
                        {
                            "s": "南沙区"
                        },
                        {
                            "s": "萝岗区"
                        },
                        {
                            "s": "增城市"
                        },
                        {
                            "s": "从化市"
                        }
                    ]
                },
                {
                    "n": "韶关",
                    "a": [
                        {
                            "s": "武江区"
                        },
                        {
                            "s": "浈江区"
                        },
                        {
                            "s": "曲江区"
                        },
                        {
                            "s": "始兴县"
                        },
                        {
                            "s": "仁化县"
                        },
                        {
                            "s": "翁源县"
                        },
                        {
                            "s": "乳源瑶族自治县"
                        },
                        {
                            "s": "新丰县"
                        },
                        {
                            "s": "乐昌市"
                        },
                        {
                            "s": "南雄市"
                        }
                    ]
                },
                {
                    "n": "深圳",
                    "a": [
                        {
                            "s": "罗湖区"
                        },
                        {
                            "s": "福田区"
                        },
                        {
                            "s": "南山区"
                        },
                        {
                            "s": "宝安区"
                        },
                        {
                            "s": "龙岗区"
                        },
                        {
                            "s": "盐田区"
                        }
                    ]
                },
              
                {
                    "n": "佛山",
                    "a": [
                        {
                            "s": "禅城区"
                        },
                        {
                            "s": "南海区"
                        },
                        {
                            "s": "顺德区"
                        },
                        {
                            "s": "三水区"
                        },
                        {
                            "s": "高明区"
                        }
                    ]
                },
               
                {
                    "n": "茂名",
                    "a": [
                        {
                            "s": "茂南区"
                        },
                        {
                            "s": "茂港区"
                        },
                        {
                            "s": "电白县"
                        },
                        {
                            "s": "高州市"
                        },
                        {
                            "s": "化州市"
                        },
                        {
                            "s": "信宜市"
                        }
                    ]
                },
                {
                    "n": "肇庆",
                    "a": [
                        {
                            "s": "端州区"
                        },
                        {
                            "s": "鼎湖区"
                        },
                        {
                            "s": "广宁县"
                        },
                        {
                            "s": "怀集县"
                        },
                        {
                            "s": "封开县"
                        },
                        {
                            "s": "德庆县"
                        },
                        {
                            "s": "高要市"
                        },
                        {
                            "s": "四会市"
                        }
                    ]
                },
                {
                    "n": "惠州",
                    "a": [
                        {
                            "s": "惠城区"
                        },
                        {
                            "s": "惠阳区"
                        },
                        {
                            "s": "博罗县"
                        },
                        {
                            "s": "惠东县"
                        },
                        {
                            "s": "龙门县"
                        }
                    ]
                },
                {
                    "n": "梅州",
                    "a": [
                        {
                            "s": "梅江区"
                        },
                        {
                            "s": "梅县"
                        },
                        {
                            "s": "大埔县"
                        },
                        {
                            "s": "丰顺县"
                        },
                        {
                            "s": "五华县"
                        },
                        {
                            "s": "平远县"
                        },
                        {
                            "s": "蕉岭县"
                        },
                        {
                            "s": "兴宁市"
                        }
                    ]
                },
                
                {
                    "n": "河源",
                    "a": [
                        {
                            "s": "源城区"
                        },
                        {
                            "s": "紫金县"
                        },
                        {
                            "s": "龙川县"
                        },
                        {
                            "s": "连平县"
                        },
                        {
                            "s": "和平县"
                        },
                        {
                            "s": "东源县"
                        }
                    ]
                },
                {
                    "n": "阳江",
                    "a": [
                        {
                            "s": "江城区"
                        },
                        {
                            "s": "阳西县"
                        },
                        {
                            "s": "阳东县"
                        },
                        {
                            "s": "阳春市"
                        }
                    ]
                },
                {
                    "n": "清远",
                    "a": [
                        {
                            "s": "清城区"
                        },
                        {
                            "s": "佛冈县"
                        },
                        {
                            "s": "阳山县"
                        },
                        {
                            "s": "连山壮族瑶族自治县"
                        },
                        {
                            "s": "连南瑶族自治县"
                        },
                        {
                            "s": "清新县"
                        },
                        {
                            "s": "英德市"
                        },
                        {
                            "s": "连州市"
                        }
                    ]
                },
                {
                    "n": "东莞",
                    "a": [
                        {
                            "s": "东莞市"
                        }
                    ]
                },
                {
                    "n": "中山",
                    "a": [
                        {
                            "s": "中山市"
                        }
                    ]
                },
                {
                    "n":"鹤山市"
                }
            ]
        },
        {
            "p": "广西",
            "c": [
                {
                    "n": "南宁",
                    "a": [
                        {
                            "s": "兴宁区"
                        },
                        {
                            "s": "青秀区"
                        },
                        {
                            "s": "江南区"
                        },
                        {
                            "s": "西乡塘区"
                        },
                        {
                            "s": "良庆区"
                        },
                        {
                            "s": "邕宁区"
                        },
                        {
                            "s": "武鸣县"
                        },
                        {
                            "s": "隆安县"
                        },
                        {
                            "s": "马山县"
                        },
                        {
                            "s": "上林县"
                        },
                        {
                            "s": "宾阳县"
                        },
                        {
                            "s": "横县"
                        }
                    ]
                },
                {
                    "n": "柳州",
                    "a": [
                        {
                            "s": "城中区"
                        },
                        {
                            "s": "鱼峰区"
                        },
                        {
                            "s": "柳南区"
                        },
                        {
                            "s": "柳北区"
                        },
                        {
                            "s": "柳江县"
                        },
                        {
                            "s": "柳城县"
                        },
                        {
                            "s": "鹿寨县"
                        },
                        {
                            "s": "融安县"
                        },
                        {
                            "s": "融水苗族自治县"
                        },
                        {
                            "s": "三江侗族自治县"
                        }
                    ]
                },
                {
                    "n": "桂林",
                    "a": [
                        {
                            "s": "秀峰区"
                        },
                        {
                            "s": "叠彩区"
                        },
                        {
                            "s": "象山区"
                        },
                        {
                            "s": "七星区"
                        },
                        {
                            "s": "雁山区"
                        },
                        {
                            "s": "阳朔县"
                        },
                        {
                            "s": "临桂县"
                        },
                        {
                            "s": "灵川县"
                        },
                        {
                            "s": "全州县"
                        },
                        {
                            "s": "兴安县"
                        },
                        {
                            "s": "永福县"
                        },
                        {
                            "s": "灌阳县"
                        },
                        {
                            "s": "龙胜各族自治县"
                        },
                        {
                            "s": "资源县"
                        },
                        {
                            "s": "平乐县"
                        },
                        {
                            "s": "荔蒲县"
                        },
                        {
                            "s": "恭城瑶族自治县"
                        }
                    ]
                },
                {
                    "n": "梧州",
                    "a": [
                        {
                            "s": "万秀区"
                        },
                        {
                            "s": "蝶山区"
                        },
                        {
                            "s": "长洲区"
                        },
                        {
                            "s": "苍梧县"
                        },
                        {
                            "s": "藤县"
                        },
                        {
                            "s": "蒙山县"
                        },
                        {
                            "s": "岑溪市"
                        }
                    ]
                },
                {
                    "n": "北海",
                    "a": [
                        {
                            "s": "海城区"
                        },
                        {
                            "s": "银海区"
                        },
                        {
                            "s": "铁山港区"
                        },
                        {
                            "s": "合浦县"
                        }
                    ]
                },
                
                {
                    "n": "钦州",
                    "a": [
                        {
                            "s": "钦南区"
                        },
                        {
                            "s": "钦北区"
                        },
                        {
                            "s": "灵山县"
                        },
                        {
                            "s": "浦北县"
                        }
                    ]
                },
                {
                    "n": "贵港",
                    "a": [
                        {
                            "s": "港北区"
                        },
                        {
                            "s": "港南区"
                        },
                        {
                            "s": "覃塘区"
                        },
                        {
                            "s": "平南县"
                        },
                        {
                            "s": "桂平市"
                        }
                    ]
                },
                {
                    "n": "玉林",
                    "a": [
                        {
                            "s": "玉州区"
                        },
                        {
                            "s": "容县"
                        },
                        {
                            "s": "陆川县"
                        },
                        {
                            "s": "博白县"
                        },
                        {
                            "s": "兴业县"
                        },
                        {
                            "s": "北流市"
                        }
                    ]
                },
                {
                    "n": "百色",
                    "a": [
                        {
                            "s": "右江区"
                        },
                        {
                            "s": "田阳县"
                        },
                        {
                            "s": "田东县"
                        },
                        {
                            "s": "平果县"
                        },
                        {
                            "s": "德保县"
                        },
                        {
                            "s": "靖西县"
                        },
                        {
                            "s": "那坡县"
                        },
                        {
                            "s": "凌云县"
                        },
                        {
                            "s": "乐业县"
                        },
                        {
                            "s": "田林县"
                        },
                        {
                            "s": "西林县"
                        },
                        {
                            "s": "隆林各族自治县"
                        }
                    ]
                },
                {
                    "n": "贺州",
                    "a": [
                        {
                            "s": "八步区"
                        },
                        {
                            "s": "昭平县"
                        },
                        {
                            "s": "钟山县"
                        },
                        {
                            "s": "富川瑶族自治县"
                        }
                    ]
                },
                {
                    "n": "河池",
                    "a": [
                        {
                            "s": "金城江区"
                        },
                        {
                            "s": "南丹县"
                        },
                        {
                            "s": "天峨县"
                        },
                        {
                            "s": "凤山县"
                        },
                        {
                            "s": "东兰县"
                        },
                        {
                            "s": "罗城仫佬族自治县"
                        },
                        {
                            "s": "环江毛南族自治县"
                        },
                        {
                            "s": "巴马瑶族自治县"
                        },
                        {
                            "s": "都安瑶族自治县"
                        },
                        {
                            "s": "大化瑶族自治县"
                        },
                        {
                            "s": "宜州市"
                        }
                    ]
                },
                {
                    "n": "来宾",
                    "a": [
                        {
                            "s": "兴宾区"
                        },
                        {
                            "s": "忻城县"
                        },
                        {
                            "s": "象州县"
                        },
                        {
                            "s": "武宣县"
                        },
                        {
                            "s": "金秀瑶族自治县"
                        },
                        {
                            "s": "合山市"
                        }
                    ]
                },
                {
                    "n": "崇左",
                    "a": [
                        {
                            "s": "江洲区"
                        },
                        {
                            "s": "扶绥县"
                        },
                        {
                            "s": "宁明县"
                        },
                        {
                            "s": "龙州县"
                        },
                        {
                            "s": "大新县"
                        },
                        {
                            "s": "天等县"
                        },
                        {
                            "s": "凭祥市"
                        }
                    ]
                },
                {
                    "n":"桂平"
                }
            ]
        },
       
        {
            "p": "重庆",
            "c": [
                {
                    "n": "万州区"
                },
                {
                    "n": "江北区"
                },
                {
                    "n": "铜梁县"
                },
                {
                    "n": "大足县"
                },
                {
                    "n":"璧山"
                }
            ]
        },
        {
            "p": "四川",
            "c": [
                {
                    "n": "成都",
                    "a": [
                        {
                            "s": "锦江区"
                        },
                        {
                            "s": "青羊区"
                        },
                        {
                            "s": "金牛区"
                        },
                        {
                            "s": "武侯区"
                        },
                        {
                            "s": "成华区"
                        },
                        {
                            "s": "龙泉驿区"
                        },
                        {
                            "s": "青白江区"
                        },
                        {
                            "s": "新都区"
                        },
                        {
                            "s": "温江区"
                        },
                        {
                            "s": "金堂县"
                        },
                        {
                            "s": "双流县"
                        },
                        {
                            "s": "郫县"
                        },
                        {
                            "s": "大邑县"
                        },
                        {
                            "s": "蒲江县"
                        },
                        {
                            "s": "新津县"
                        },
                        {
                            "s": "都江堰市"
                        },
                        {
                            "s": "彭州市"
                        },
                        {
                            "s": "邛崃市"
                        },
                        {
                            "s": "崇州市"
                        }
                    ]
                },
               
                {
                    "n": "德阳",
                    "a": [
                        {
                            "s": "旌阳区"
                        },
                        {
                            "s": "中江县"
                        },
                        {
                            "s": "罗江县"
                        },
                        {
                            "s": "广汉市"
                        },
                        {
                            "s": "什邡市"
                        },
                        {
                            "s": "绵竹市"
                        }
                    ]
                },
                {
                    "n": "绵阳",
                    "a": [
                        {
                            "s": "涪城区"
                        },
                        {
                            "s": "游仙区"
                        },
                        {
                            "s": "三台县"
                        },
                        {
                            "s": "盐亭县"
                        },
                        {
                            "s": "安县"
                        },
                        {
                            "s": "梓潼县"
                        },
                        {
                            "s": "北川羌族自治县"
                        },
                        {
                            "s": "平武县"
                        },
                        {
                            "s": "江油市"
                        }
                    ]
                },
                {
                    "n": "广元",
                    "a": [
                        {
                            "s": "利州区"
                        },
                        {
                            "s": "元坝区"
                        },
                        {
                            "s": "朝天区"
                        },
                        {
                            "s": "旺苍县"
                        },
                        {
                            "s": "青川县"
                        },
                        {
                            "s": "剑阁县"
                        },
                        {
                            "s": "苍溪县"
                        }
                    ]
                },
               
                {
                    "n": "南充",
                    "a": [
                        {
                            "s": "顺庆区"
                        },
                        {
                            "s": "高坪区"
                        },
                        {
                            "s": "嘉陵区"
                        },
                        {
                            "s": "南部县"
                        },
                        {
                            "s": "营山县"
                        },
                        {
                            "s": "蓬安县"
                        },
                        {
                            "s": "仪陇县"
                        },
                        {
                            "s": "西充县"
                        },
                        {
                            "s": "阆中市"
                        }
                    ]
                },
                {
                    "n": "眉山",
                    "a": [
                        {
                            "s": "东坡区"
                        },
                        {
                            "s": "仁寿县"
                        },
                        {
                            "s": "彭山县"
                        },
                        {
                            "s": "洪雅县"
                        },
                        {
                            "s": "丹棱县"
                        },
                        {
                            "s": "青神县"
                        }
                    ]
                },
                {
                    "n": "宜宾",
                    "a": [
                        {
                            "s": "翠屏区"
                        },
                        {
                            "s": "宜宾县"
                        },
                        {
                            "s": "南溪县"
                        },
                        {
                            "s": "江安县"
                        },
                        {
                            "s": "长宁县"
                        },
                        {
                            "s": "高县"
                        },
                        {
                            "s": "珙县"
                        },
                        {
                            "s": "筠连县"
                        },
                        {
                            "s": "兴文县"
                        },
                        {
                            "s": "屏山县"
                        }
                    ]
                },
                {
                    "n": "广安",
                    "a": [
                        {
                            "s": "广安区"
                        },
                        {
                            "s": "岳池县"
                        },
                        {
                            "s": "武胜县"
                        },
                        {
                            "s": "邻水县"
                        },
                        {
                            "s": "华蓥市"
                        }
                    ]
                },
               
                {
                    "n": "雅安",
                    "a": [
                        {
                            "s": "雨城区"
                        },
                        {
                            "s": "名山县"
                        },
                        {
                            "s": "荥经县"
                        },
                        {
                            "s": "汉源县"
                        },
                        {
                            "s": "石棉县"
                        },
                        {
                            "s": "天全县"
                        },
                        {
                            "s": "芦山县"
                        },
                        {
                            "s": "宝兴县"
                        }
                    ]
                },
                {
                    "n": "巴中",
                    "a": [
                        {
                            "s": "巴州区"
                        },
                        {
                            "s": "通江县"
                        },
                        {
                            "s": "南江县"
                        },
                        {
                            "s": "平昌县"
                        }
                    ]
                },
                {
                    "n": "资阳",
                    "a": [
                        {
                            "s": "雁江区"
                        },
                        {
                            "s": "安岳县"
                        },
                        {
                            "s": "乐至县"
                        },
                        {
                            "s": "简阳市"
                        }
                    ]
                },
                {
                    "n":"仁寿"
                }
            ]
        },
        {
            "p": "贵州",
            "c": [
                {
                    "n": "贵阳",
                    "a": [
                        {
                            "s": "南明区"
                        },
                        {
                            "s": "云岩区"
                        },
                        {
                            "s": "花溪区"
                        },
                        {
                            "s": "乌当区"
                        },
                        {
                            "s": "白云区"
                        },
                        {
                            "s": "小河区"
                        },
                        {
                            "s": "开阳县"
                        },
                        {
                            "s": "息烽县"
                        },
                        {
                            "s": "修文县"
                        },
                        {
                            "s": "清镇市"
                        }
                    ]
                },
                {
                    "n": "六盘水",
                    "a": [
                        {
                            "s": "钟山区"
                        },
                        {
                            "s": "六枝特区"
                        },
                        {
                            "s": "水城县"
                        },
                        {
                            "s": "盘县"
                        }
                    ]
                },
                {
                    "n": "遵义",
                    "a": [
                        {
                            "s": "红花岗区"
                        },
                        {
                            "s": "汇川区"
                        },
                        {
                            "s": "遵义县"
                        },
                        {
                            "s": "桐梓县"
                        },
                        {
                            "s": "绥阳县"
                        },
                        {
                            "s": "正安县"
                        },
                        {
                            "s": "道真仡佬族苗族自治县"
                        },
                        {
                            "s": "务川仡佬族苗族自治县"
                        },
                        {
                            "s": "凤冈县"
                        },
                        {
                            "s": "湄潭县"
                        },
                        {
                            "s": "余庆县"
                        },
                        {
                            "s": "习水县"
                        },
                        {
                            "s": "赤水市"
                        },
                        {
                            "s": "仁怀市"
                        }
                    ]
                },
               
                {
                    "n": "铜仁",
                    "a": [
                        {
                            "s": "铜仁市"
                        },
                        {
                            "s": "江口县"
                        },
                        {
                            "s": "玉屏侗族自治县"
                        },
                        {
                            "s": "石阡县"
                        },
                        {
                            "s": "思南县"
                        },
                        {
                            "s": "印江土家族苗族自治县"
                        },
                        {
                            "s": "德江县"
                        },
                        {
                            "s": "沿河土家族自治县"
                        },
                        {
                            "s": "松桃苗族自治县"
                        },
                        {
                            "s": "万山特区"
                        }
                    ]
                },
                
                {
                    "n": "毕节",
                    "a": [
                        {
                            "s": "毕节市"
                        },
                        {
                            "s": "大方县"
                        },
                        {
                            "s": "黔西县"
                        },
                        {
                            "s": "金沙县"
                        },
                        {
                            "s": "织金县"
                        },
                        {
                            "s": "纳雍县"
                        },
                        {
                            "s": "威宁彝族回族苗族自治县"
                        },
                        {
                            "s": "赫章县"
                        }
                    ]
                },
                {
                    "n": "黔东南",
                    "a": [
                        {
                            "s": "凯里市"
                        },
                        {
                            "s": "黄平县"
                        },
                        {
                            "s": "施秉县"
                        },
                        {
                            "s": "三穗县"
                        },
                        {
                            "s": "镇远县"
                        },
                        {
                            "s": "岑巩县"
                        },
                        {
                            "s": "天柱县"
                        },
                        {
                            "s": "锦屏县"
                        },
                        {
                            "s": "剑河县"
                        },
                        {
                            "s": "台江县"
                        },
                        {
                            "s": "黎平县"
                        },
                        {
                            "s": "榕江县"
                        },
                        {
                            "s": "从江县"
                        },
                        {
                            "s": "雷山县"
                        },
                        {
                            "s": "麻江县"
                        },
                        {
                            "s": "丹寨县"
                        }
                    ]
                },
                {
                    "n": "黔南",
                    "a": [
                        {
                            "s": "都匀市"
                        },
                        {
                            "s": "福泉市"
                        },
                        {
                            "s": "荔波县"
                        },
                        {
                            "s": "贵定县"
                        },
                        {
                            "s": "瓮安县"
                        },
                        {
                            "s": "独山县"
                        },
                        {
                            "s": "平塘县"
                        },
                        {
                            "s": "罗甸县"
                        },
                        {
                            "s": "长顺县"
                        },
                        {
                            "s": "龙里县"
                        },
                        {
                            "s": "惠水县"
                        },
                        {
                            "s": "三都水族自治县"
                        }
                    ]
                },
                {
                    "n":"都匀"
                }
            ]
        },
        {
            "p": "云南",
            "c": [
                {
                    "n": "昆明",
                    "a": [
                        {
                            "s": "五华区"
                        },
                        {
                            "s": "盘龙区"
                        },
                        {
                            "s": "官渡区"
                        },
                        {
                            "s": "西山区"
                        },
                        {
                            "s": "东川区"
                        },
                        {
                            "s": "呈贡县"
                        },
                        {
                            "s": "晋宁县"
                        },
                        {
                            "s": "富民县"
                        },
                        {
                            "s": "宜良县"
                        },
                        {
                            "s": "石林彝族自治县"
                        },
                        {
                            "s": "嵩明县"
                        },
                        {
                            "s": "禄劝彝族苗族自治县"
                        },
                        {
                            "s": "寻甸回族彝族自治县"
                        },
                        {
                            "s": "安宁市"
                        }
                    ]
                },
                
                {
                    "n": "玉溪",
                    "a": [
                        {
                            "s": "红塔区"
                        },
                        {
                            "s": "江川县"
                        },
                        {
                            "s": "澄江县"
                        },
                        {
                            "s": "通海县"
                        },
                        {
                            "s": "华宁县"
                        },
                        {
                            "s": "易门县"
                        },
                        {
                            "s": "峨山彝族自治县"
                        },
                        {
                            "s": "新平彝族傣族自治县"
                        },
                        {
                            "s": "元江哈尼族彝族傣族自治县"
                        }
                    ]
                },
                {
                    "n": "保山",
                    "a": [
                        {
                            "s": "隆阳区"
                        },
                        {
                            "s": "施甸县"
                        },
                        {
                            "s": "腾冲县"
                        },
                        {
                            "s": "龙陵县"
                        },
                        {
                            "s": "昌宁县"
                        }
                    ]
                },
               
                {
                    "n": "楚雄",
                    "a": [
                        {
                            "s": "楚雄市"
                        },
                        {
                            "s": "双柏县"
                        },
                        {
                            "s": "牟定县"
                        },
                        {
                            "s": "南华县"
                        },
                        {
                            "s": "姚安县"
                        },
                        {
                            "s": "大姚县"
                        },
                        {
                            "s": "永仁县"
                        },
                        {
                            "s": "元谋县"
                        },
                        {
                            "s": "武定县"
                        },
                        {
                            "s": "禄丰县"
                        }
                    ]
                },
               
                {
                    "n": "文山",
                    "a": [
                        {
                            "s": "文山县"
                        },
                        {
                            "s": "砚山县"
                        },
                        {
                            "s": "西畴县"
                        },
                        {
                            "s": "麻栗坡县"
                        },
                        {
                            "s": "马关县"
                        },
                        {
                            "s": "丘北县"
                        },
                        {
                            "s": "广南县"
                        },
                        {
                            "s": "富宁县"
                        }
                    ]
                }
               
               
            ]
        },
       
        {
            "p": "陕西",
            "c": [
                {
                    "n": "西安",
                    "a": [
                        {
                            "s": "新城区"
                        },
                        {
                            "s": "碑林区"
                        },
                        {
                            "s": "莲湖区"
                        },
                        {
                            "s": "灞桥区"
                        },
                        {
                            "s": "未央区"
                        },
                        {
                            "s": "雁塔区"
                        },
                        {
                            "s": "阎良区"
                        },
                        {
                            "s": "临潼区"
                        },
                        {
                            "s": "长安区"
                        },
                        {
                            "s": "蓝田县"
                        },
                        {
                            "s": "周至县"
                        },
                        {
                            "s": "户县"
                        },
                        {
                            "s": "高陵县"
                        }
                    ]
                },
                
                {
                    "n": "宝鸡",
                    "a": [
                        {
                            "s": "渭滨区"
                        },
                        {
                            "s": "金台区"
                        },
                        {
                            "s": "陈仓区"
                        },
                        {
                            "s": "凤翔县"
                        },
                        {
                            "s": "岐山县"
                        },
                        {
                            "s": "扶风县"
                        },
                        {
                            "s": "眉县"
                        },
                        {
                            "s": "陇县"
                        },
                        {
                            "s": "千阳县"
                        },
                        {
                            "s": "麟游县"
                        },
                        {
                            "s": "凤县"
                        },
                        {
                            "s": "太白县"
                        }
                    ]
                },
                
               
                {
                    "n": "商洛",
                    "a": [
                        {
                            "s": "商州区"
                        },
                        {
                            "s": "洛南县"
                        },
                        {
                            "s": "丹凤县"
                        },
                        {
                            "s": "商南县"
                        },
                        {
                            "s": "山阳县"
                        },
                        {
                            "s": "镇安县"
                        },
                        {
                            "s": "柞水县"
                        }
                    ]
                },
                {
                    "n":"韩城"
                }
            ]
        },
        {
            "p": "甘肃",
            "c": [
                {
                    "n": "兰州",
                    "a": [
                        {
                            "s": "区(县)"
                        },
                        {
                            "s": "城关区"
                        },
                        {
                            "s": "七里河区"
                        },
                        {
                            "s": "西固区"
                        },
                        {
                            "s": "安宁区"
                        },
                        {
                            "s": "红古区"
                        },
                        {
                            "s": "永登县"
                        },
                        {
                            "s": "皋兰县"
                        },
                        {
                            "s": "榆中县"
                        }
                    ]
                },
                {
                    "n": "白银",
                    "a": [
                        {
                            "s": "白银区"
                        },
                        {
                            "s": "平川区"
                        },
                        {
                            "s": "靖远县"
                        },
                        {
                            "s": "会宁县"
                        },
                        {
                            "s": "景泰县"
                        }
                    ]
                },
              
                {
                    "n": "张掖",
                    "a": [
                        {
                            "s": "甘州区"
                        },
                        {
                            "s": "肃南裕固族自治县"
                        },
                        {
                            "s": "民乐县"
                        },
                        {
                            "s": "临泽县"
                        },
                        {
                            "s": "高台县"
                        },
                        {
                            "s": "山丹县"
                        }
                    ]
                },
                {
                    "n": "平凉",
                    "a": [
                        {
                            "s": "崆峒区"
                        },
                        {
                            "s": "泾川县"
                        },
                        {
                            "s": "灵台县"
                        },
                        {
                            "s": "崇信县"
                        },
                        {
                            "s": "华亭县"
                        },
                        {
                            "s": "庄浪县"
                        },
                        {
                            "s": "静宁县"
                        }
                    ]
                },
                {
                    "n": "酒泉",
                    "a": [
                        {
                            "s": "肃州区"
                        },
                        {
                            "s": "金塔县"
                        },
                        {
                            "s": "瓜州县"
                        },
                        {
                            "s": "肃北蒙古族自治县"
                        },
                        {
                            "s": "阿克塞哈萨克族自治县"
                        },
                        {
                            "s": "玉门市"
                        },
                        {
                            "s": "敦煌市"
                        }
                    ]
                },
                {
                    "n": "庆阳",
                    "a": [
                        {
                            "s": "西峰区"
                        },
                        {
                            "s": "庆城县"
                        },
                        {
                            "s": "环县"
                        },
                        {
                            "s": "华池县"
                        },
                        {
                            "s": "合水县"
                        },
                        {
                            "s": "正宁县"
                        },
                        {
                            "s": "宁县"
                        },
                        {
                            "s": "镇原县"
                        }
                    ]
                },
                {
                    "n": "定西",
                    "a": [
                        {
                            "s": "安定区"
                        },
                        {
                            "s": "通渭县"
                        },
                        {
                            "s": "陇西县"
                        },
                        {
                            "s": "渭源县"
                        },
                        {
                            "s": "临洮县"
                        },
                        {
                            "s": "漳县"
                        },
                        {
                            "s": "岷县"
                        }
                    ]
                },
                {
                    "n": "陇南",
                    "a": [
                        {
                            "s": "武都区"
                        },
                        {
                            "s": "成县"
                        },
                        {
                            "s": "文县"
                        },
                        {
                            "s": "宕昌县"
                        },
                        {
                            "s": "康县"
                        },
                        {
                            "s": "西和县"
                        },
                        {
                            "s": "礼县"
                        },
                        {
                            "s": "徽县"
                        },
                        {
                            "s": "两当县"
                        }
                    ]
                }
              
            ]
        }
    ]
},
            prov:null,
            city:null,
            dist:null,
            nodata:null,
            required:true
        },settings);

        var box_obj=this;
        var prov_obj=box_obj.find(".prov");
        var city_obj=box_obj.find(".city");
        var dist_obj=box_obj.find(".dist");
        var prov_val=settings.prov;
        var city_val=settings.city;
        var dist_val=settings.dist;
        var select_prehtml=(settings.required) ? "" : "<option value=''>请选择</option>";
        var city_json;

        // 赋值市级函数
        var cityStart=function(){
            var prov_id=prov_obj.get(0).selectedIndex;
            if(!settings.required){
                prov_id--;
            };
            city_obj.empty().attr("disabled",true);
            dist_obj.empty().attr("disabled",true);

            if(prov_id<0||typeof(city_json.citylist[prov_id].c)=="undefined"){
                if(settings.nodata=="none"){
                    //city_obj.css("display","none");
                    // dist_obj.css("display","none");
                }else if(settings.nodata=="hidden"){
                    city_obj.css("visibility","hidden");
                    dist_obj.css("visibility","hidden");
                };
                return;
            };
            
            // 遍历赋值市级下拉列表
            temp_html=select_prehtml;
            $.each(city_json.citylist[prov_id].c,function(i,city){
                temp_html+="<option value='"+city.n+"'>"+city.n+"</option>";
            });
            city_obj.html(temp_html).attr("disabled",false).css({"display":"","visibility":""});
            distStart();
        };

        // 赋值地区（县）函数
        var distStart=function(){
            var prov_id=prov_obj.get(0).selectedIndex;
            var city_id=city_obj.get(0).selectedIndex;
            if(!settings.required){
                prov_id--;
                city_id--;
            };
            dist_obj.empty().attr("disabled",true);

            if(prov_id<0||city_id<0||typeof(city_json.citylist[prov_id].c[city_id].a)=="undefined"){
                if(settings.nodata=="none"){
                    // dist_obj.css("display","none");
                }else if(settings.nodata=="hidden"){
                    dist_obj.css("visibility","hidden");
                };
                return;
            };
            
            // 遍历赋值市级下拉列表
            temp_html=select_prehtml;
            $.each(city_json.citylist[prov_id].c[city_id].a,function(i,dist){
                temp_html+="<option value='"+dist.s+"'>"+dist.s+"</option>";
            });
            dist_obj.html(temp_html).attr("disabled",false).css({"display":"","visibility":""});
        };

        var init=function(){
            // 遍历赋值省份下拉列表
            temp_html=select_prehtml;
            $.each(city_json.citylist,function(i,prov){
                temp_html+="<option value='"+prov.p+"'>"+prov.p+"</option>";
            });
            prov_obj.html(temp_html);

            // 若有传入省份与市级的值，则选中。（setTimeout为兼容IE6而设置）
            setTimeout(function(){
                if(settings.prov!=null){
                    prov_obj.val(settings.prov);
                    cityStart();
                    setTimeout(function(){
                        if(settings.city!=null){
                            city_obj.val(settings.city);
                            distStart();
                            setTimeout(function(){
                                if(settings.dist!=null){
                                    dist_obj.val(settings.dist);
                                };
                            },1);
                        };
                    },1);
                };
            },1);

            // 选择省份时发生事件
            prov_obj.bind("change",function(){
                cityStart();
            });

            // 选择市级时发生事件
            city_obj.bind("change",function(){
                distStart();
            });
        };

        // 设置省市json数据
        if(typeof(settings.url)=="string"){
            $.getJSON(settings.url,function(json){
                city_json=json;
                init();
            });
        }else{
            city_json=settings.url;
            init();
        };
    };
})(jQuery);